---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.RemoveValue(Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue)
source: html/09a2e38a-645e-5653-88fb-83228454e6bb.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.RemoveValue Method

Removes a value to the value set for this demand factor definition

## Syntax (C#)
```csharp
public void RemoveValue(
	ElectricalDemandFactorValue dfValue
)
```

## Parameters
- **dfValue** (`Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue`) - Value to remove from the set

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null